In [1]:
from sqlalchemy import create_engine, text

In [3]:
database_name = 'prescribers'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

In [7]:
import pandas as pd

In [9]:
import matplotlib.pyplot as plt

In [10]:
import numpy as np

In [13]:
import seaborn as sns

In [14]:
question1 = 'SELECT * FROM  overdose_deaths INNER JOIN fips_county ON overdose_deaths.fipscounty = fips_county.fipscounty::int'

In [17]:
with engine.connect() as connection:
    question1 = pd.read_sql(text(question1), con = connection)

**1. Deaths over time.
  a. How has total overdose deaths changed over time?
  b. How have overdose deaths changed over time for Davidson and Shelby counties.
  c. Are there any counties in which overdose deaths are trending downwa**
  rd?

**a. How has total overdose deaths changed over time?**

In [19]:
q1a = question1[['overdose_deaths','year']]

In [21]:
death_over_time = q1a.groupby(['year']).sum('overdose_deaths')

In [23]:
death_over_time = death_over_time.reset_index()

In [15]:
death_over_time

   year  overdose_deaths
0  2015             1033
1  2016             1186
2  2017             1267
3  2018             1304

**b. How have overdose deaths changed over time for Davidson and Shelby counties.**

In [17]:
question1

     overdose_deaths  year fipscounty      county state fipscounty fipsstate
0                 18  2018      47001    ANDERSON    TN      47001        47
1                 34  2017      47001    ANDERSON    TN      47001        47
2                 24  2016      47001    ANDERSON    TN      47001        47
3                 20  2015      47001    ANDERSON    TN      47001        47
4                  7  2018      47003     BEDFORD    TN      47003        47
..               ...   ...        ...         ...   ...        ...       ...
375               21  2015      47187  WILLIAMSON    TN      47187        47
376               19  2018      47189      WILSON    TN      47189        47
377               26  2017      47189      WILSON    TN      47189        47
378               27  2016      47189      WILSON    TN      47189        47
379               26  2015      47189      WILSON    TN      47189        47

[380 rows x 7 columns]

In [18]:
davidson_county = question1.loc[question1.county == 'DAVIDSON']

In [19]:
davidson_county = davidson_county.reset_index()

In [20]:
davidson_county = davidson_county.drop(columns = 'state')

In [21]:
davidson_county = davidson_county.rename(columns = {'overdose_deaths' : 'davidson_overdose_deaths'})

In [22]:
shelby_county = question1.loc[question1.county =='SHELBY']

In [23]:
shelby_county = shelby_county.reset_index()

In [24]:
shelby_county = shelby_county.drop(columns = ['index', 'fipscounty','state','fipsstate'])

In [25]:
shelby_county = shelby_county.rename(columns = {'overdose_deaths': 'shelby_overdose_deaths', 'year' : 'years'})

In [26]:
shelby_county

   shelby_overdose_deaths  years  county
0                     123   2018  SHELBY
1                     159   2017  SHELBY
2                     150   2016  SHELBY
3                     135   2015  SHELBY

In [27]:
davidson_shelby = pd.concat([davidson_county, shelby_county], axis=1)

In [28]:
davidson_shelby

,index,davidson_overdose_deaths,year,fipscounty,county,fipscounty,fipsstate,shelby_overdose_deaths,years,county
0,72,200,2018,47037,DAVIDSON,47037,47,123,2018,SHELBY
1,73,184,2017,47037,DAVIDSON,47037,47,159,2017,SHELBY
2,74,178,2016,47037,DAVIDSON,47037,47,150,2016,SHELBY
3,75,127,2015,47037,DAVIDSON,47037,47,135,2015,SHELBY

In [29]:
davidson_shelby = davidson_shelby.drop(columns = 'fipscounty')

In [30]:
davidson_shelby = davidson_shelby.drop(columns = 'year')

In [31]:
davidson_shelby = davidson_shelby.rename(columns = {'years' : 'year'})

In [32]:
davidson_shelby = davidson_shelby.drop(columns = 'fipsstate')

In [33]:
davidson_shelby

,index,davidson_overdose_deaths,county,shelby_overdose_deaths,year,county
0,72,200,DAVIDSON,123,2018,SHELBY
1,73,184,DAVIDSON,159,2017,SHELBY
2,74,178,DAVIDSON,150,2016,SHELBY
3,75,127,DAVIDSON,135,2015,SHELBY

**c. Are there any counties in which overdose deaths are trending downward?**

In [35]:
question1c = question1[['overdose_deaths','county','year']]

In [36]:
question1c

     overdose_deaths      county  year
0                 18    ANDERSON  2018
1                 34    ANDERSON  2017
2                 24    ANDERSON  2016
3                 20    ANDERSON  2015
4                  7     BEDFORD  2018
..               ...         ...   ...
375               21  WILLIAMSON  2015
376               19      WILSON  2018
377               26      WILSON  2017
378               27      WILSON  2016
379               26      WILSON  2015

[380 rows x 3 columns]

In [37]:
questionc2018 = question1c.loc[question1c.year == 2018]

In [38]:
questionc2016 = question1c.loc[question1c.year == 2016]

In [39]:
questionc2017 = question1c.loc[question1c.year == 2017]

In [40]:
questionc2015 = question1c.loc[question1c.year == 2015]

In [41]:
questionc2015

     overdose_deaths      county  year
3                 20    ANDERSON  2015
7                  8     BEDFORD  2015
11                 4      BENTON  2015
15                 1     BLEDSOE  2015
19                19      BLOUNT  2015
..               ...         ...   ...
363                3       WAYNE  2015
367                4     WEAKLEY  2015
371                7       WHITE  2015
375               21  WILLIAMSON  2015
379               26      WILSON  2015

[95 rows x 3 columns]

In [42]:
questionc2015

     overdose_deaths      county  year
3                 20    ANDERSON  2015
7                  8     BEDFORD  2015
11                 4      BENTON  2015
15                 1     BLEDSOE  2015
19                19      BLOUNT  2015
..               ...         ...   ...
363                3       WAYNE  2015
367                4     WEAKLEY  2015
371                7       WHITE  2015
375               21  WILLIAMSON  2015
379               26      WILSON  2015

[95 rows x 3 columns]

**3. Per Capita
  a. Which county has the highest overdose deaths per capita?
  b. Which county has the most spending overall per capita?
  c. Which county has the most spending on opioids per capi**ta?

**3a. Which county has the highest overdose deaths per capita?**

In [45]:
question1

     overdose_deaths  year fipscounty      county state fipscounty fipsstate
0                 18  2018      47001    ANDERSON    TN      47001        47
1                 34  2017      47001    ANDERSON    TN      47001        47
2                 24  2016      47001    ANDERSON    TN      47001        47
3                 20  2015      47001    ANDERSON    TN      47001        47
4                  7  2018      47003     BEDFORD    TN      47003        47
..               ...   ...        ...         ...   ...        ...       ...
375               21  2015      47187  WILLIAMSON    TN      47187        47
376               19  2018      47189      WILSON    TN      47189        47
377               26  2017      47189      WILSON    TN      47189        47
378               27  2016      47189      WILSON    TN      47189        47
379               26  2015      47189      WILSON    TN      47189        47

[380 rows x 7 columns]

In [46]:
question3 = 'SELECT county, SUM(overdose_deaths) AS total_overdose_deaths, population FROM  overdose_deaths INNER JOIN fips_county ON overdose_deaths.fipscounty = fips_county.fipscounty::int INNER JOIN population ON overdose_deaths.fipscounty = population.fipscounty::int GROUP BY county, population ORDER BY total_overdose_deaths DESC'

In [47]:
with engine.connect() as connection:
    question3 = pd.read_sql(text(question3), con = connection)

In [48]:
question3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95 entries, 0 to 94
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   county                 95 non-null     object
 1   total_overdose_deaths  95 non-null     int64
 2   population             95 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.4+ KB

In [49]:
question3.population = question3.population.astype('int64')

In [50]:
question3

        county  total_overdose_deaths  population
0     DAVIDSON                    689      678322
1         KNOX                    683      452286
2       SHELBY                    567      937847
3   RUTHERFORD                    205      298456
4     HAMILTON                    191      354589
..         ...                    ...         ...
90     PICKETT                      2        5071
91        DYER                      2       37751
92     HAYWOOD                      2       17944
93       PERRY                      1        7882
94        LAKE                      0        7588

[95 rows x 3 columns]

In [51]:
question3['Overdoses_Per_Capita_1000'] = question3.total_overdose_deaths / question3.population *1000

In [52]:
question3

        county  total_overdose_deaths  population  Overdoses_Per_Capita_1000
0     DAVIDSON                    689      678322                   1.015742
1         KNOX                    683      452286                   1.510106
2       SHELBY                    567      937847                   0.604576
3   RUTHERFORD                    205      298456                   0.686868
4     HAMILTON                    191      354589                   0.538652
..         ...                    ...         ...                        ...
90     PICKETT                      2        5071                   0.394400
91        DYER                      2       37751                   0.052979
92     HAYWOOD                      2       17944                   0.111458
93       PERRY                      1        7882                   0.126871
94        LAKE                      0        7588                   0.000000

[95 rows x 4 columns]

In [53]:
question3.sort_values(by = 'Overdoses_Per_Capita_1000', ascending = False)

      county  total_overdose_deaths  population  Overdoses_Per_Capita_1000
15  CHEATHAM                     73       39713                   1.838189
65   HANCOCK                     10        6605                   1.514005
1       KNOX                    683      452286                   1.510106
14     ROANE                     77       52926                   1.454862
61      CLAY                     11        7684                   1.431546
..       ...                    ...         ...                        ...
85   CARROLL                      4       28137                   0.142162
93     PERRY                      1        7882                   0.126871
92   HAYWOOD                      2       17944                   0.111458
91      DYER                      2       37751                   0.052979
94      LAKE                      0        7588                   0.000000

[95 rows x 4 columns]

In [54]:
question3pop = 'SELECT SUM(total_drug_cost) as total_drug_cost_per_county, county, population FROM prescription INNER JOIN prescriber USING(npi) INNER JOIN zip_fips ON zip_fips.zip = prescriber.nppes_provider_zip5 INNER JOIN population ON zip_fips.fipscounty = population.fipscounty INNER JOIN fips_county ON fips_county.fipscounty = population.fipscounty GROUP BY county,population'

In [55]:
with engine.connect() as connection:
    question3pop = pd.read_sql(text(question3pop), con = connection)

In [56]:
question3pop.population = question3pop.population.astype('int')

In [57]:
question3pop['Drug_Cost_Per_Capita'] = question3pop.total_drug_cost_per_county / question3pop.population

In [58]:
question3pop.sort_values(by ='Drug_Cost_Per_Capita', ascending = False)

    total_drug_cost_per_county      county  population  Drug_Cost_Per_Capita
12                 40885537.73       MOORE        6302           6487.708304
58                 58186128.32     JACKSON       11573           5027.748062
57                 19339093.38   VAN BUREN        5675           3407.769759
10                 14063285.46     PICKETT        5071           2773.276565
34                 60174204.18     OVERTON       21995           2735.812875
..                         ...         ...         ...                   ...
33                 12917772.09      TIPTON       61434            210.270731
56                 32346714.21  MONTGOMERY      192120            168.367240
14                  3846679.98    GRAINGER       22942            167.669775
19                  3787504.46  LAUDERDALE       26497            142.940879
37                   634646.44        LAKE        7588             83.638171

[95 rows x 4 columns]

 **c. Which county has the most spending on opioids per capita?**

In [60]:
question3opioid = 'SELECT SUM(total_drug_cost) as total_drug_cost_per_county, county, population,opioid_drug_flag FROM prescription INNER JOIN prescriber USING(npi) INNER JOIN zip_fips ON zip_fips.zip = prescriber.nppes_provider_zip5 INNER JOIN population ON zip_fips.fipscounty = population.fipscounty INNER JOIN fips_county ON fips_county.fipscounty = population.fipscounty INNER JOIN drug USING(drug_name) GROUP BY county,population,opioid_drug_flag'

In [61]:
with engine.connect() as connection:
    question3opioid = pd.read_sql(text(question3opioid), con = connection)

In [62]:
question3opioid.population = question3opioid.population.astype('int64')

In [63]:
question3opioid = question3opioid.loc[question3opioid.opioid_drug_flag == 'Y']

In [64]:
question3opioid['Opioids_per_capita'] = question3opioid.total_drug_cost_per_county / question3opioid.population

In [65]:
question3opioid.sort_values( by ='Opioids_per_capita', ascending = False)

,total_drug_cost_per_county,county,population,opioid_drug_flag,Opioids_per_capita
44,1957723.74,MOORE,6302,Y,310.651181
61,3137499.57,JACKSON,11573,Y,271.105121
55,1352207.35,TROUSDALE,8773,Y,154.132834
86,3270860.27,OVERTON,21995,Y,148.709264
18,697548.14,PICKETT,5071,Y,137.556328
...,...,...,...,...,...
180,159363.83,HENDERSON,27889,Y,5.714218
118,142525.39,LAUDERDALE,26497,Y,5.378926
25,97806.16,GRAINGER,22942,Y,4.263192
99,34771.94,DECATUR,11681,Y,2.976795
23,2964.93,LAKE,7588,Y,0.390739

**2. Spending on opioids
  a. What is the correlation between spending on opioids and overdose deaths?
  b. What is the ratio for spending on opioid vs non-opioid prescriptions?
  c. Are those who spend a higher ratio on opioids suffering from more deaths?**

In [27]:
question2 = 'SELECT overdose_deaths, total_drug_cost, year, opioid_drug_flag FROM overdose_deaths as od INNER JOIN zip_fips as zf ON od.fipscounty::int = zf.fipscounty::int INNER JOIN prescriber as p1 ON zf.zip = p1.nppes_provider_zip5 INNER JOIN prescription as p2 ON p1.npi = p2.npi INNER JOIN drug as d ON p2.drug_name = d.drug_name GROUP BY year, overdose_deaths, total_drug_cost,opioid_drug_flag'

In [29]:
with engine.connect() as connection:
    question2 = pd.read_sql(text(question2), con = connection)

In [30]:
opioids = question2.loc[question2['opioid_drug_flag'] == 'Y']

In [31]:
opioids = opioids.groupby('year')[['overdose_deaths','total_drug_cost']].sum()

In [32]:
opioids['overdose_deaths'].corr(opioids['total_drug_cost'])

-0.7699102661723042

In [33]:
question2

         overdose_deaths  total_drug_cost  year opioid_drug_flag
0                     24           244.31  2017                N
1                      4            99.19  2016                N
2                     12          3440.38  2017                N
3                     17           914.59  2015                N
4                     10          1006.15  2015                N
...                  ...              ...   ...              ...
3819393                5            86.68  2015                N
3819394               24           571.84  2017                N
3819395               13           557.00  2018                N
3819396                2           422.75  2017                N
3819397                6           401.57  2018                N

[3819398 rows x 4 columns]

In [39]:
not_opioids = question2.loc[question2['opioid_drug_flag'] == 'N']

In [61]:
not_opioids = not_opioids.groupby('year')[['overdose_deaths','total_drug_cost']].sum()

In [43]:
opioids

      overdose_deaths  total_drug_cost
year
2015          2046894     1.686489e+08
2016          2543310     1.679709e+08
2017          2819155     1.660675e+08
2018          2843770     1.676229e+08

In [57]:
opioids

      overdose_deaths  total_drug_cost
year
2015          2046894     1.686489e+08
2016          2543310     1.679709e+08
2017          2819155     1.660675e+08
2018          2843770     1.676229e+08

In [117]:
not_opioids = not_opioids.rename( columns = {'total_drug_cost':'total_not_opioid_cost'})

In [119]:
comparing = pd.concat([opioids, not_opioids], axis=1)

In [121]:
comparing

      overdose_deaths  total_drug_cost  overdose_deaths  total_not_opioid_cost
year
2015          2046894     1.686489e+08         33238796           4.390615e+09
2016          2543310     1.679709e+08         40930381           4.401374e+09
2017          2819155     1.660675e+08         45191046           4.356430e+09
2018          2843770     1.676229e+08         45506017           4.370697e+09

In [123]:
comparing = comparing.rename(columns = {'total_drug_cost':'opioid_total_cost'})

In [125]:
comparing = comparing.drop(columns = 'overdose_deaths')

In [145]:
comparing.round()

      opioid_total_cost  total_not_opioid_cost
year
2015        168648885.0           4.390615e+09
2016        167970855.0           4.401374e+09
2017        166067490.0           4.356430e+09
2018        167622856.0           4.370697e+09

In [109]:
comparing_cost = 'SELECT * FROM drug as d INNER JOIN prescription USING(drug_name)'

In [111]:
with engine.connect() as connection:
    comparing_cost = pd.read_sql(text(comparing_cost), con = connection)

In [112]:
comparing_cost

,drug_name,generic_name,opioid_drug_flag,long_acting_opioid_drug_flag,antibiotic_drug_flag,antipsychotic_drug_flag,npi,bene_count,total_claim_count,total_30_day_fill_count,total_day_supply,total_drug_cost,bene_count_ge65,bene_count_ge65_suppress_flag,total_claim_count_ge65,ge65_suppress_flag,total_30_day_fill_count_ge65,total_day_supply_ge65,total_drug_cost_ge65
0,ROPINIROLE HCL,ROPINIROLE HCL,N,N,N,N,1.104865e+09,NaN,34.0,36.0,1012.0,280.37,NaN,*,20.0,None,22.0,600.0,175.73
1,ACITRETIN,ACITRETIN,N,N,N,N,1.265530e+09,NaN,11.0,28.3,849.0,7650.53,NaN,*,NaN,*,NaN,NaN,NaN
2,ACETAMINOPHEN-CODEINE,ACETAMINOPHEN WITH CODEINE,Y,N,N,N,1.871565e+09,NaN,52.0,52.0,1383.0,951.17,NaN,*,40.0,None,40.0,1023.0,740.60
3,DEXILANT,DEXLANSOPRAZOLE,N,N,N,N,1.508833e+09,NaN,11.0,19.0,570.0,4792.42,NaN,*,11.0,None,19.0,570.0,4792.42
4,CIPROFLOXACIN HCL,CIPROFLOXACIN HCL,N,N,Y,N,1.073874e+09,11.0,11.0,11.0,69.0,64.22,NaN,*,NaN,*,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
705010,ATORVASTATIN CALCIUM,ATORVASTATIN CALCIUM,N,N,N,N,1.679889e+09,22.0,118.0,168.0,5027.0,1799.48,NaN,#,66.0,None,106.0,3180.0,1163.21
705011,LANSOPRAZOLE,LANSOPRAZOLE,N,N,N,N,1.295708e+09,NaN,17.0,33.0,990.0,334.19,NaN,*,NaN,*,NaN,NaN,NaN
705012,ZETIA,EZETIMIBE,N,N,N,N,1.295830e+09,NaN,13.0,19.0,570.0,6158.90,NaN,*,NaN,*,NaN,NaN,NaN
705013,DIGOXIN,DIGOXIN,N,N,N,N,1.730378e+09,NaN,20.0,47.0,1410.0,1480.54,NaN,*,20.0,None,47.0,1410.0,1480.54
705014,LIDOCAINE-PRILOCAINE,LIDOCAINE/PRILOCAINE,N,N,N,N,1.053720e+09,NaN,17.0,17.0,378.0,1894.54,NaN,*,NaN,*,NaN,NaN,NaN